app/controllers/attendances_controller.rb

  def index
    @attendances = Attendance.all
---
SELECT "attendances".* FROM "attendances"

  def create
    attendance = Attendance.create(attendance_params)
---
INSERT INTO "attendances" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 23], ["event_id", 13], ["created_at", "2020-09-17 20:51:38.185319"], ["updated_at", "2020-09-17 20:51:38.185319"]]

  def destroy
    attendance = Attendance.find(params[:id])
    attendance.destroy!
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
DELETE FROM "attendances" WHERE "attendances"."id" = $1  [["id", 36]]